[
  {
    "h2s": [
      "Title: Nutrela soyabean is halal or haram?",
      "Question: I want to ask whether \"Nutrela Soyabean chunks\" is halal or haram. someone told us that his relative visited there and saw pig's fat in its factory. Can you tell me the real truth by investigating the same.also i would like to know that which soya sauce is halal or haram."
    ],
    "spans": [
      "Social Matters",
      "Food & Drinks",
      "Question ID: 49301",
      "",
      "Answer ID: 49301",
      ""
    ],
    "ps": [
      "Social Matters >> Food & Drinks",
      "Question ID: 49301",
      "Answer ID: 49301",
      "Bismillah hir-Rahman nir-Rahim !",
      "(Fatwa: 1578/1042/L=01/1434) Soya bean is a kind of vegetable, there is no harm in using it. We are not sure that it contains pig fat as well as we do not know what the ingredients of soya bean sauce are.",
      "Allah (Subhana Wa Ta'ala) knows Best",
      "Darul Ifta,",
      "Darul Uloom Deoband, India"
    ]
  },
  {
    "h2s": [
      "Title: MIQAT FROM BAHRAIN",
      "Question: We are going to hajj this year from Mumbai, and our flight if via Bahrain (stay at Bahrain 5 or 6 hours). Please confirm where we should wear ihram, Mumbai or Bahrain and where will be Miqat for us?"
    ],
    "spans": [
      "Prayers & Duties",
      "Hajj & Umrah",
      "Question ID: 172657",
      "",
      "Answer ID: 172657",
      ""
    ],
    "ps": [
      "Prayers & Duties >> Hajj & Umrah",
      "Question ID: 172657",
      "Answer ID: 172657",
      "Bismillah hir-Rahman nir-Rahim !",
      "",
      "(Fatwa: 1245/1083/D=12/1440)",
      " ",
      "If it is a direct flight from Mumbai to Bahrain then you need not to wear Ihram from Mumbai. The Miqat of Bahrain people will be same as yours. You should ask them what is their Miqat from Bahrain to Jeddah rather it is better if you wear ihram from Bahrain.",
      "",
      "Allah (Subhana Wa Ta'ala) knows Best",
      "Darul Ifta,",
      "Darul Uloom Deoband, India"
    ]
  },
  {
    "h2s": [
      "Title: Seeking help from awaliya",
      "Question: My question going to shrine (Mazar) of Auliya kiram and seeking help from them or making them as mediator to Almighty Allah is right or wrong according to Quran and Sunnah?"
    ],
    "spans": [
      "Faiths & Beliefs",
      "Innovations & Customs",
      "Question ID: 43036",
      "",
      "Answer ID: 43036",
      ""
    ],
    "ps": [
      "Faiths & Beliefs >> Innovations & Customs",
      "Question ID: 43036",
      "Answer ID: 43036",
      "Bismillah hir-Rahman nir-Rahim !",
      "(Fatwa: 45/45/M=1434) One should not visit such Mazars (graves) where Shirk and Bid’ah is practiced and where men and women meet together. It is not lawful to seek help from Awliya. Yes, one can supplicate with their intermediation.",
      "Allah (Subhana Wa Ta'ala) knows Best",
      "Darul Ifta,",
      "Darul Uloom Deoband, India"
    ]
  },
  {
    "h2s": [
      "Title: What is the meaning of Uzair (Name of Prophet ) and Amen. (2) What is the openion of Ulama Deoband about the Sipa-ai-Sahaba (Hazarat Molana Haq Nawaz Jhangvi and Molana Azam Tariq Shaheed)?",
      "Question: What is the meaning of Uzair (Name of Prophet ) and Amen. (2) What is the openion of Ulama Deoband about the Sipa-ai-Sahaba (Hazarat Molana Haq Nawaz Jhangvi and Molana Azam Tariq Shaheed)?"
    ],
    "spans": [
      "Miscellaneous",
      "History & Biography",
      "Question ID: 1141",
      "",
      "Answer ID: 1141",
      "",
      "(Fatwa: 1067/795=H)",
      " ",
      "(1) Uzair (Alaihis Salam) was an eminent prophet of Allah, but we do not know the meaning of Uzair.",
      " ",
      "(2) ?Amen? is an expression used at the end of prayers, meaning So be it",
      " ",
      "(3) Contact local Ulama regarding the same."
    ],
    "ps": [
      "Miscellaneous >> History & Biography",
      "Question ID: 1141",
      "Answer ID: 1141",
      "Bismillah hir-Rahman nir-Rahim !",
      "",
      "(Fatwa: 1067/795=H)",
      " ",
      "(1) Uzair (Alaihis Salam) was an eminent prophet of Allah, but we do not know the meaning of Uzair.",
      " ",
      "(2) ?Amen? is an expression used at the end of prayers, meaning So be it",
      " ",
      "(3) Contact local Ulama regarding the same.",
      "",
      "Allah (Subhana Wa Ta'ala) knows Best",
      "Darul Ifta,",
      "Darul Uloom Deoband, India"
    ]
  },
  {
    "h2s": [
      "Title: asalamyalykum, 1) My niyat is to start business as soon as possible becasue i am doing job for this reason i do not pray juma salah and other many fard salah, the month of holy ramzan is coming please sugest me any dua or amal by which allah help me lot, and i start any halal business and pray for me. asalamulykum. 2) if one did not recite dua'y quonot in third rakat of witer prayer, and in the state of jalsa in third rakat his mind remind him that he did not recite dua'y quonot in this rakat while his is reciting darood shrief or while he is reciting dua alahuma inni zalamtumafsi... what he do ? sajda sahu or again repray witer salah..",
      "Question: asalamyalykum, 1) My niyat is to start business as soon as possible becasue i am doing job for this reason i do not pray juma salah and other many fard salah, the month of holy ramzan is coming please sugest me any dua or amal by which allah help me lot, and i start any halal business and pray for me. asalamulykum. 2) if one did not recite dua'y quonot in third rakat of witer prayer, and in the state of jalsa in third rakat his mind remind him that he did not recite dua'y quonot in this rakat while his is reciting darood shrief or while he is reciting dua alahuma inni zalamtumafsi... what he do ? sajda sahu or again repray witer salah."
    ],
    "spans": [
      "Miscellaneous",
      "Dua (Supplications)",
      "Question ID: 13371",
      "",
      "Answer ID: 13371",
      "",
      "(Fatwa: 911/911=M/1430)",
      " ",
      "If you want Allah to help you, you must help the religion of Allah, do not commit any negligence towards Shariah matters. The best amal is to perform five-time salah regularly. Also, you should recite Ayatul Kursi after every salah and supplicate to Allah, in-shaAllah it will cause blessing and prosperity.",
      "(2) He should turn his head for salam and perform sajdah sahv the same time he remembered, the salah will be valid. There is no need to re-perform the same."
    ],
    "ps": [
      "Miscellaneous >> Dua (Supplications)",
      "Question ID: 13371",
      "Answer ID: 13371",
      "Bismillah hir-Rahman nir-Rahim !",
      "",
      "(Fatwa: 911/911=M/1430)",
      " ",
      "If you want Allah to help you, you must help the religion of Allah, do not commit any negligence towards Shariah matters. The best amal is to perform five-time salah regularly. Also, you should recite Ayatul Kursi after every salah and supplicate to Allah, in-shaAllah it will cause blessing and prosperity.",
      "(2) He should turn his head for salam and perform sajdah sahv the same time he remembered, the salah will be valid. There is no need to re-perform the same.",
      "",
      "Allah (Subhana Wa Ta'ala) knows Best",
      "Darul Ifta,",
      "Darul Uloom Deoband, India"
    ]
  },
  {
    "h2s": [
      "Title: Is it possible for mother feeding while fasting?",
      "Question: Is it possible for mother feeding while fasting?"
    ],
    "spans": [
      "Prayers & Duties",
      "Sawm (Fasting)",
      "Question ID: 24919",
      "",
      "Answer ID: 24919",
      ""
    ],
    "ps": [
      "Prayers & Duties >> Sawm (Fasting)",
      "Question ID: 24919",
      "Answer ID: 24919",
      "Bismillah hir-Rahman nir-Rahim !",
      "(Fatwa: 1320/1320/M=1431)\n\nYes, she can breastfeed. It does not invalidate the fast.",
      "Allah (Subhana Wa Ta'ala) knows Best",
      "Darul Ifta,",
      "Darul Uloom Deoband, India"
    ]
  },
  {
    "h2s": [
      "Title: Qurbani according to Sunaah.",
      "Question: I received few videos and some hadith in Whatsapp that we are supposed to give only one goat as qurbani for the whole family (Husband, wife, Mother, Father, children), ie one earner in the house one goat. And if that person can afford he can give how many he can afford. Till now we are giving one goat per person. So please enlighten me in this regard according to sunnah that one goat per person or one goat per earner/ whole family."
    ],
    "spans": [
      "Prayers & Duties",
      "Qurbani (Slaughtering)",
      "Question ID: 62083",
      "",
      "Answer ID: 62083",
      ""
    ],
    "ps": [
      "Prayers & Duties >> Qurbani (Slaughtering)",
      "Question ID: 62083",
      "Answer ID: 62083",
      "Bismillah hir-Rahman nir-Rahim !",
      "(Fatwa: 35/35/B=01/1437) This must have been sent by any ghair Muqallid. It is against the Hadith. According to the Hadith qurbani is wajib on every rich (sahib nisab). Separate qurbani is wajib on both the husband and wife as well as separate qurbani is wajib on father and mother. If the children are adult and stay separately and are prosperous and are sahib nisab then each one will have to offer separate qurbani. Yes, if someone offers nafl qurbani and includes his family and the whole Muslim community in its rewards then it is alright.",
      "Allah (Subhana Wa Ta'ala) knows Best",
      "Darul Ifta,",
      "Darul Uloom Deoband, India"
    ]
  },
  {
    "h2s": [
      "Title: I did umra with very short hair. After that I went to the barber shop and he trimmed my hair. He didnot shave it. Since the hair was very short - so the trimming finished fast because only little hair could be cut. So, is there dam on me? Please explain",
      "Question: I did umra with very short hair. After that I went to the barber shop and he trimmed my hair. He didnot shave it. Since the hair was very short - so the trimming finished fast because only little hair could be cut. So, is there dam on me? Please explain"
    ],
    "spans": [
      "Prayers & Duties",
      "Hajj & Umrah",
      "Question ID: 23579",
      "",
      "Answer ID: 23579",
      ""
    ],
    "ps": [
      "Prayers & Duties >> Hajj & Umrah",
      "Question ID: 23579",
      "Answer ID: 23579",
      "Bismillah hir-Rahman nir-Rahim !",
      "(Fatwa: 1044/774/L=1431)\n\nIt is necessary to cut the hair equal to the tip of finger. If the hairs are too short to cut equal to one finger tip, then it is wajib to shave the head.\nقال فى مجمع الانهر: ثم يحلق وهو أفضل من تقصير أو يقصر بأن يأخذ من شعره قدر الأنملة وجوباً و تقصير الكل مندوب والربع واجب (مجمع الانهر: 1/280)\nSo if your hair were too short to cut equal to finger tip then as per the question mentioned above, dam (slaughter of an animal) shall be wajib on you.",
      "Allah (Subhana Wa Ta'ala) knows Best",
      "Darul Ifta,",
      "Darul Uloom Deoband, India"
    ]
  },
  {
    "h2s": [
      "Title: I am a working lady.I am entering into 30s.I am still unmarried and waiting for a reasonable proposal.My parents particularly my father doesn?t take interest in arranging my marriage.They are not fear of my single marital status and increasing age.But I am much worried as in this society it is very difficult for a woman to live without a shelter and HUSBAND is a real shelter for a woman but my parents think as my job serves as a shelter and future protection for me. It is stongly requested to tell me some wazifa or zikar for a good proposal and change of mind of my father who is not interested in my marriage.Or suggest some ruhani elaj.",
      "Question: Assalam o Alaikum! Sir, I am a working lady.I am entering into 30s.I am still unmarried and waiting for a reasonable proposal.My parents particularly my father doesn?t take interest in arranging my marriage.They are not fear of my single marital status and increasing age.But I am much worried as in this society it is very difficult for a woman to live without a shelter and HUSBAND is a real shelter for a woman but my parents think as my job serves as a shelter and future protection for me. It is stongly requested to tell me some wazifa or zikar for a good proposal and change of mind of my father who is not interested in my marriage.Or suggest some ruhani elaj.JAZAKALLAH"
    ],
    "spans": [
      "Miscellaneous",
      "Dua (Supplications)",
      "Question ID: 20839",
      "",
      "Answer ID: 20839",
      "",
      "(Fatwa: 531/L=176/tl=1431)",
      " ",
      "Be regular in salah and supplicate Almighty Allah for better proposal. After Isha salah recite ya Lateef (",
      "يا",
      "",
      "لطيف",
      "",
      "لطيف",
      "",
      ") 1100 times with durood 11-11 times before and after.",
      "",
      ""
    ],
    "ps": [
      "Miscellaneous >> Dua (Supplications)",
      "Question ID: 20839",
      "Answer ID: 20839",
      "Bismillah hir-Rahman nir-Rahim !",
      "",
      "(Fatwa: 531/L=176/tl=1431)",
      " ",
      "Be regular in salah and supplicate Almighty Allah for better proposal. After Isha salah recite ya Lateef (يا لطيف) 1100 times with durood 11-11 times before and after.",
      "",
      "Allah (Subhana Wa Ta'ala) knows Best",
      "Darul Ifta,",
      "Darul Uloom Deoband, India"
    ]
  },
  {
    "h2s": [
      "Title: Elder son expired leaving behind widow and two children. Mother-in-law stays with elder daughter-in-law.",
      "Question: Elder son expired leaving behind widow and two children. Mother-in-law stays with elder daughter-in-law. Younger son stays with wife and two kids, working in a company from 8:00 to 8:00. Father-in-law insists staying with younger son. Since kids are also off to school, so father-in-law and younger daughter-in-law are alone in the house whole day. Younger son insisted his father to be with the elder son's family as they need him but father refuses. Younger son requested his father at least during the day he should stay with the elder son's family and during night he could come and stay but father refuses and instead stays at home only and does not go out even for some time. Since, mother and father stay away, they have become somewhat indifferent to each other. Objective of younger son is to make parents stay together as father often complains of loneliness while staying at younger son's house, as younger daughter-in-law does not speak much with father-in-law. If younger son forces his father, is it ok?"
    ],
    "spans": [
      "Social Matters",
      "Nikah (Marriage)",
      "Question ID: 33010",
      "",
      "Answer ID: 33010",
      ""
    ],
    "ps": [
      "Social Matters >> Nikah (Marriage)",
      "Question ID: 33010",
      "Answer ID: 33010",
      "Bismillah hir-Rahman nir-Rahim !",
      "(Fatwa: 1421/866/H=1432) The younger son is right in saying. It is not lawful for father-in-law to stay with his daughter-in-law alone that too for the whole day. He (father) should stay with his wife.",
      "Allah (Subhana Wa Ta'ala) knows Best",
      "Darul Ifta,",
      "Darul Uloom Deoband, India"
    ]
  },
  {
    "h2s": [
      "Title: Shed some light with help of hadith reference how reliable is the claim that in ramadan every acts reward are multiplied by 70 .. like if we recite one subhanallah it's reward is like 70 subhanallah?? Answer before ramadan would be appreciated.",
      "Question: Shed some light with help of hadith reference how reliable is the claim that in ramadan every acts reward are multiplied by 70 .. like if we recite one subhanallah it's reward is like 70 subhanallah?? Answer before ramadan would be appreciated."
    ],
    "spans": [
      "Prayers & Duties",
      "Sawm (Fasting)",
      "Question ID: 25354",
      "",
      "Answer ID: 25354",
      ""
    ],
    "ps": [
      "Prayers & Duties >> Sawm (Fasting)",
      "Question ID: 25354",
      "Answer ID: 25354",
      "Bismillah hir-Rahman nir-Rahim !",
      "(Fatwa: 1566/10013/L=1431)\n\nIn the holy month of Ramadan, the reward of virtues is increased. It is mentioned in hadith that the status of nafl is raised up to fardh and the reward of one fardh is equal to seventy fardh. However, we could not find any hadith, which says that the reward of each virtue is increased to seventy fold.",
      "Allah (Subhana Wa Ta'ala) knows Best",
      "Darul Ifta,",
      "Darul Uloom Deoband, India"
    ]
  },
  {
    "h2s": [
      "Title: I am an Engineer working in MNC company. I wanted to know how to save TAX, as the amount of TAX that is deducted is increasing day by day. This is a concern of many professionals, and i didnt invest in Life Insurance or any other thing as its not jayaz. Please help me and other muslims as well who as struct here and much money of muslims are wasted in TAX.",
      "Question: As Salamu alaykum wa Rahmatullahi wa Barakatahu, I am an Engineer working in MNC company. I wanted to know how to save TAX, as the amount of TAX that is deducted is increasing day by day. This is a concern of many professionals, and i didnt invest in Life Insurance or any other thing as its not jayaz. Please help me and other muslims as well who as struct here and much money of muslims are wasted in TAX. ALLAH HAFIZ"
    ],
    "spans": [
      "Miscellaneous",
      "Halal & Haram",
      "Question ID: 7698",
      "",
      "Answer ID: 7698",
      "",
      "(Fatwa: 1747/1644=D/1429)",
      " ",
      "The government levies the tax amount for carrying out administrative affairs. For saving tax one should adopt a way which is legal. If you have any interest amount left in you account, then you can pay tax with it. But for this purpose (to pay tax), it is unlawful to deliberately deposit amount and then take interest or do life insurance, for these are interest-based dealings which Muslims must shun from."
    ],
    "ps": [
      "Miscellaneous >> Halal & Haram",
      "Question ID: 7698",
      "Answer ID: 7698",
      "Bismillah hir-Rahman nir-Rahim !",
      "",
      "(Fatwa: 1747/1644=D/1429)",
      " ",
      "The government levies the tax amount for carrying out administrative affairs. For saving tax one should adopt a way which is legal. If you have any interest amount left in you account, then you can pay tax with it. But for this purpose (to pay tax), it is unlawful to deliberately deposit amount and then take interest or do life insurance, for these are interest-based dealings which Muslims must shun from.",
      "",
      "Allah (Subhana Wa Ta'ala) knows Best",
      "Darul Ifta,",
      "Darul Uloom Deoband, India"
    ]
  },
  {
    "h2s": [
      "Title: Question1-Is it permissible to throw dead animals like cats birds mice etc in dustbins if theres no convinient place to bury them? Question2-Is it permissible to eat owl? Question3-Is it permissible to recycle Islamic litrature with non Islamic litrature together if theres no place to bury it or unable to put it in water?(Because in England all papers Islamic and non Islamic are recycled together) Question4-Is it permissible to feed Insects like worms etc dead and alive to Chickens?",
      "Question: Question1-Is it permissible to throw dead animals like cats birds mice etc in dustbins if theres no convinient place to bury them? Question2-Is it permissible to eat owl? Question3-Is it permissible to recycle Islamic litrature with non Islamic litrature together if theres no place to bury it or unable to put it in water?(Because in England all papers Islamic and non Islamic are recycled together) Question4-Is it permissible to feed Insects like worms etc dead and alive to Chickens?"
    ],
    "spans": [
      "Miscellaneous",
      "Halal & Haram",
      "Question ID: 6945",
      "",
      "Answer ID: 6945",
      "",
      "(Fatwa: 1467/1248=B/1429)",
      " ",
      "You can cast them in dustbins.",
      "(2) It is unlawful and haram, it is predatory bird.",
      "(3) Yes, the Islamic literature can be recycled.",
      "(4) Yes, it is allowed."
    ],
    "ps": [
      "Miscellaneous >> Halal & Haram",
      "Question ID: 6945",
      "Answer ID: 6945",
      "Bismillah hir-Rahman nir-Rahim !",
      "",
      "(Fatwa: 1467/1248=B/1429)",
      " ",
      "You can cast them in dustbins.",
      "(2) It is unlawful and haram, it is predatory bird.",
      "(3) Yes, the Islamic literature can be recycled.",
      "(4) Yes, it is allowed.",
      "",
      "Allah (Subhana Wa Ta'ala) knows Best",
      "Darul Ifta,",
      "Darul Uloom Deoband, India"
    ]
  },
  {
    "h2s": [
      "Title: Hotel meat and boliled chicken",
      "Question: Assalamalyeikum Mufti saheb.Is this valid to eat Nonveg items in the Muslim hotels as they say they do Halal. But how can we know if they are doing proper Halal or Not. Also eating Chicken which has been halal with use of hot water.It is helpful if you give some idea on the way of proper halal."
    ],
    "spans": [
      "Social Matters",
      "Food & Drinks",
      "Question ID: 32014",
      "",
      "Answer ID: 32014",
      ""
    ],
    "ps": [
      "Social Matters >> Food & Drinks",
      "Question ID: 32014",
      "Answer ID: 32014",
      "Bismillah hir-Rahman nir-Rahim !",
      "(Fatwa: 745/619/B=1432) (1) If the owner of Muslim hotel claims that the meat is halal, his words shall be acceptable. But if you have any doubt due to any reason you can avoid eating it. The ruling of haram shall be applicable if you observe yourself being slaughtered on non-Shariah method. (2) Usually they put chicken in hot water after slaughtering for awhile until the skin softens and gets off easily. It is not right to eat such a chicken that is put in hot water so long that its filth is cooked and its bad smell is absorbed in the meat, thus all the meat gets impure and unclean. Eating such chicken is not right.",
      "Allah (Subhana Wa Ta'ala) knows Best",
      "Darul Ifta,",
      "Darul Uloom Deoband, India"
    ]
  },
  {
    "h2s": [
      "Title: My mother she has a heart problem for a long time but now the doctors say that she should have a open heart operation as soon as possible,I am requesting that please make dua for my mother and i would like you to give me a dua or wazifaa to read at the time of operation.",
      "Question: A.Alykm,Dear sheikh my mother she has a heart problem for a long time but now the doctors say that she should have a open heart operation as soon as possible,I am requesting that please make dua for my mother and i would like you to give me a dua or wazifaa to read at the time of operation.shukran,Jazakallah."
    ],
    "spans": [
      "Miscellaneous",
      "Dua (Supplications)",
      "Question ID: 29488",
      "",
      "Answer ID: 29488",
      ""
    ],
    "ps": [
      "Miscellaneous >> Dua (Supplications)",
      "Question ID: 29488",
      "Answer ID: 29488",
      "Bismillah hir-Rahman nir-Rahim !",
      "(Fatwa: 239/239/M=1432)\n\nRecite the following dua with durood 7-7 times before and after and blow on your mother:\nأسأل الله العظيم ، رب العرش العظيم أن يشفي والدتي شفاءُ كاملاً .\nYour mother too should keep on reciting durood. May Almighty Allah cure her completely and make the operation successful!",
      "Allah (Subhana Wa Ta'ala) knows Best",
      "Darul Ifta,",
      "Darul Uloom Deoband, India"
    ]
  },
  {
    "h2s": [
      "Title: I have a question regarding congretional dua after every fard prayer and collective dua. Is it biddah or what. please clarify.",
      "Question: I have a question regarding congretional dua after every fard prayer and collective dua. Is it biddah or what. please clarify."
    ],
    "spans": [
      "Prayers & Duties",
      "Salah (Prayer)",
      "Question ID: 6985",
      "",
      "Answer ID: 6985",
      "",
      "(Fatwa: 1319/1238=D/1429)",
      " ",
      "Supplicating after performing obligatory salah is proved by the Hadith and it is also narrated that the supplication is a virtuous thing. The people should supplicate individually; however it is not wrong if it looks like congregational. If someone ends the prayer earlier while the other prays a bit longer, it is also not wrong, it is allowed. By ?congregational? if you mean some other method, then you should explain it."
    ],
    "ps": [
      "Prayers & Duties >> Salah (Prayer)",
      "Question ID: 6985",
      "Answer ID: 6985",
      "Bismillah hir-Rahman nir-Rahim !",
      "",
      "(Fatwa: 1319/1238=D/1429)",
      " ",
      "Supplicating after performing obligatory salah is proved by the Hadith and it is also narrated that the supplication is a virtuous thing. The people should supplicate individually; however it is not wrong if it looks like congregational. If someone ends the prayer earlier while the other prays a bit longer, it is also not wrong, it is allowed. By ?congregational? if you mean some other method, then you should explain it.",
      "",
      "Allah (Subhana Wa Ta'ala) knows Best",
      "Darul Ifta,",
      "Darul Uloom Deoband, India"
    ]
  },
  {
    "h2s": [
      "Title: My wife calls me beta and mera baccha some times. What is the ruling in shariya for this? What I heard is calling one's husband beta or mera baccha is wrong and one has to pay kaffara for that. The same thing holds good for the husband too, if he calls his wife amma.",
      "Question: My wife calls me beta and mera baccha some times. What is the ruling in shariya for this? What I heard is calling one's husband beta or mera baccha is wrong and one has to pay kaffara for that. The same thing holds good for the husband too, if he calls his wife amma."
    ],
    "spans": [
      "Social Matters",
      "Talaq (Divorce)",
      "Question ID: 3731",
      "",
      "Answer ID: 3731",
      "",
      "(Fatwa: 30/30=M)",
      " ",
      "It is nonsense for a wife to call her husband with 'beta' or 'mera bachha'. Likewise, if husband calls his wife 'amma' (without mentioning a word of resemblance) then also it is null and void; it does not affect nikah, neither does it cause talaq nor zihar. It is only nonsense from which one should avoid."
    ],
    "ps": [
      "Social Matters >> Talaq (Divorce)",
      "Question ID: 3731",
      "Answer ID: 3731",
      "Bismillah hir-Rahman nir-Rahim !",
      "",
      "(Fatwa: 30/30=M)",
      " ",
      "It is nonsense for a wife to call her husband with 'beta' or 'mera bachha'. Likewise, if husband calls his wife 'amma' (without mentioning a word of resemblance) then also it is null and void; it does not affect nikah, neither does it cause talaq nor zihar. It is only nonsense from which one should avoid.",
      "",
      "Allah (Subhana Wa Ta'ala) knows Best",
      "Darul Ifta,",
      "Darul Uloom Deoband, India"
    ]
  },
  {
    "h2s": [
      "Title: Breaking of Wudhu",
      "Question: Does killing ants or any other animals, insects break wudhu?"
    ],
    "spans": [
      "Prayers & Duties",
      "Taharah (Purity)",
      "Question ID: 47646",
      "",
      "Answer ID: 47646",
      ""
    ],
    "ps": [
      "Prayers & Duties >> Taharah (Purity)",
      "Question ID: 47646",
      "Answer ID: 47646",
      "Bismillah hir-Rahman nir-Rahim !",
      "(Fatwa: 1217/1217/M=10/1434) Wudhu does not break by killing ant and other insects as it is not from amongst the things which break wudhu. Wudhu breaks if some impure thing comes out of body or one passes the wind.",
      "Allah (Subhana Wa Ta'ala) knows Best",
      "Darul Ifta,",
      "Darul Uloom Deoband, India"
    ]
  }
]
